# SQL Constraints

## NOT NULL
Ensures a column cannot store NULL values.

In [ ]:
DROP TABLE CUST_NOTNULL;

In [ ]:
CREATE TABLE CUST_NOTNULL (
    CustomerID NUMBER NOT NULL,
    CustomerName VARCHAR2(50) NOT NULL,
    Email VARCHAR2(100)
);

In [ ]:
DESC CUST_NOTNULL;

In [ ]:
INSERT ALL
  INTO CUST_NOTNULL (CustomerID, CustomerName, Email) VALUES (1, 'Arjun Sharma', 'arjun@example.com')
  INTO CUST_NOTNULL (CustomerID, CustomerName) VALUES (2, 'Priya Nair')
SELECT * FROM dual;

In [ ]:
SELECT * FROM CUST_NOTNULL;

In [ ]:
INSERT INTO CUST_NOTNULL (CustomerID, CustomerName) VALUES (NULL, 'Ramesh Iyer'); -- Invalid

In [ ]:
INSERT INTO CUST_NOTNULL (CustomerID, Email) VALUES (3, 'ramesh@example.com'); -- Invalid

In [ ]:
SELECT * FROM CUST_NOTNULL;

## DEFAULT
Provides a value when none is given explicitly.

In [ ]:
DROP TABLE CUST_DEFAULT;

In [ ]:
CREATE TABLE CUST_DEFAULT (
    CustomerID NUMBER PRIMARY KEY,
    CustomerName VARCHAR2(50) NOT NULL,
    Status VARCHAR2(20) DEFAULT 'Active' NOT NULL
);

In [ ]:
DESC CUST_DEFAULT;

In [ ]:
INSERT ALL
  INTO CUST_DEFAULT (CustomerID, CustomerName) VALUES (1, 'Meena Kumari')
  INTO CUST_DEFAULT (CustomerID, CustomerName, Status) VALUES (2, 'Suresh Reddy', 'Inactive')
  INTO CUST_DEFAULT (CustomerID, CustomerName) VALUES (3, 'Raj Kamal')
SELECT * FROM dual;

In [ ]:
SELECT * FROM CUST_DEFAULT;

In [ ]:
INSERT INTO CUST_DEFAULT (CustomerID, CustomerName, Status) VALUES (3, 'Ananya Kadam', NULL); -- Invalid

In [ ]:
SELECT * FROM CUST_DEFAULT;

## UNIQUE
Prevents duplicate values in a column.

In [ ]:
DROP TABLE CUST_UNIQUE;

In [ ]:
CREATE TABLE CUST_UNIQUE (
    CustomerID NUMBER PRIMARY KEY,
    CustomerName VARCHAR2(50) NOT NULL,
    Email VARCHAR2(100) UNIQUE
);

In [ ]:
DESC CUST_UNIQUE;

In [ ]:
INSERT ALL
  INTO CUST_UNIQUE VALUES (1, 'Kavita Pal', 'kavita@example.com')
  INTO CUST_UNIQUE VALUES (2, 'Neha Gupta', NULL)
SELECT * FROM dual;

In [ ]:
SELECT * FROM CUST_UNIQUE;

In [ ]:
INSERT INTO CUST_UNIQUE VALUES (3, 'Manoj Verma', 'kavita@example.com'); -- Invalid

In [ ]:
INSERT INTO CUST_UNIQUE VALUES (4, 'Arjun Lal', 'kavita@example.com'); -- Invalid

In [ ]:
SELECT * FROM CUST_UNIQUE;

- Unique ensures no two non-null values are the same.
- Multiple NULLs are allowed.

## CHECK
Restricts values to satisfy a condition.

In [ ]:
DROP TABLE OD_CHECK;

In [ ]:
CREATE TABLE OD_CHECK (
    OrderID NUMBER,
    ProductName VARCHAR2(50),
    Quantity NUMBER CHECK (Quantity BETWEEN 1 AND 100),
    Price NUMBER CHECK (Price >= 1)
);

In [ ]:
DESC OD_CHECK;

In [ ]:
INSERT ALL
  INTO OD_CHECK VALUES (101, 'Laptop', 1, 800)
  INTO OD_CHECK VALUES (101, 'Mouse', 2, 200)
SELECT * FROM dual;

In [ ]:
SELECT * FROM OD_CHECK;

In [ ]:
INSERT INTO OD_CHECK VALUES (102, 'TV', 0, 1500); -- Invalid

In [ ]:
INSERT INTO OD_CHECK VALUES (103, 'Remote', 1, -10); -- Invalid

In [ ]:
SELECT * FROM OD_CHECK;

##PRIMARY KEY
Combines NOT NULL + UNIQUE to identify each row.

In [ ]:
DROP TABLE PROD_PK;

In [ ]:
CREATE TABLE PROD_PK (
    ProductID NUMBER PRIMARY KEY,
    ProductName VARCHAR2(50) NOT NULL
);

In [ ]:
DESC PROD_PK;

In [ ]:
INSERT ALL
  INTO PROD_PK VALUES (1, 'Laptop')
  INTO PROD_PK VALUES (2, 'Mouse')
SELECT * FROM dual;

In [ ]:
SELECT * FROM PROD_PK;

In [ ]:
INSERT INTO PROD_PK VALUES (2, 'Another Mouse'); -- Invalid

In [ ]:
INSERT INTO PROD_PK VALUES (NULL, 'TV'); -- Invalid

In [ ]:
SELECT * FROM PROD_PK;

## FOREIGN KEY
Links child to parent table.

In [ ]:
DROP TABLE ORDERS_FK;

In [ ]:
DROP TABLE CUST_FK;

In [ ]:
CREATE TABLE CUST_FK (
    CustomerID NUMBER PRIMARY KEY,
    CustomerName VARCHAR2(50) NOT NULL
);

In [ ]:
CREATE TABLE ORDERS_FK (
    OrderID NUMBER PRIMARY KEY,
    CustomerID NUMBER,
    OrderDate DATE,
    FOREIGN KEY (CustomerID) REFERENCES CUST_FK(CustomerID)
);

In [ ]:
DESC CUST_FK;

In [ ]:
DESC ORDERS_FK;

In [ ]:
INSERT ALL
  INTO CUST_FK VALUES (1, 'Arjun Sharma')
  INTO CUST_FK VALUES (2, 'Priya Nair')
SELECT * FROM dual;

In [ ]:
INSERT INTO ORDERS_FK VALUES (101, 1, DATE '2025-01-10');

In [ ]:
INSERT INTO ORDERS_FK VALUES (102, 2, DATE '2025-01-11');

In [ ]:
SELECT * FROM CUST_FK;

In [ ]:
SELECT * FROM ORDERS_FK;

In [ ]:
INSERT INTO ORDERS_FK VALUES (103, 999, DATE '2025-01-12'); -- Invalid

In [ ]:
SELECT * FROM CUST_FK;

In [ ]:
SELECT * FROM ORDERS_FK;

## Cheat Sheet
| Constraint | Purpose | Example | Notes |
|------------|---------|---------|-------|
| NOT NULL | Mandatory value | `name VARCHAR2(50) NOT NULL` | Prevents NULLs |
| DEFAULT | Auto value if omitted | `status VARCHAR2(20) DEFAULT 'Active'` | Applied when missing |
| UNIQUE | Prevent duplicates | `email VARCHAR2(100) UNIQUE` | Multiple NULLs allowed |
| CHECK | Enforce condition | `CHECK (Quantity > 0)` | Business rule |
| PRIMARY KEY | Unique identifier | `id NUMBER PRIMARY KEY` | Combines NOT NULL + UNIQUE |
| FOREIGN KEY | Parentâ€“child relation | `FOREIGN KEY (...) REFERENCES ...` | Options: CASCADE / SET NULL |